package api.awt.component;
/*
Date :
Author :
Desc : 콤포넌트 개념정리
 * */
/*
컴포넌트의 정의
- 밀접한 관계에 있는 S/W 의 패키지
- 독립적으로 개발되어 분배될 수 있는 단위
- 다른 컴포넌트와 조립되도록, 
	제공하는 서비스(provie interface)
	사용하는 서비스(require interface)
	를 정의함
 * */
/*
컴포넌트 사용 예
- C++ 템플릿 파라미터
- 상용(상업용) 캘린더 패키지, 워드 프로세서, 엑셀
- Java Swing 컴포넌트와 같은 클래스 프레임워크
- 자원할당 모델 프레임워크
 * */
/*컴포넌트의 조건
- 독립적으로 개발되어 분배될 수 있는 단위
- 제공하는 서비스에 대하여 명시적으로 잘 정의된 인터페이스가 있음
- 컴포넌트 자체를 수정하지 않고 다른 컴포넌트와 조립될 수 있어야 함
 * */
/*
 컴포넌트 조립
- 조립될 수 있는 컴포넌트 선택
- 제공하는 인터페이스와 요구되는 인터페이스의 연결  
 * */
public class ComponentSyntax {

}
